/**
 * ESM
 * - ECMAScript Module 또는 줄여서 ESM은 자바스크립트 표준이다.
 * - ECMA라는 국제 기구에서 관리하며 ECMAScript 6(ES6)에서 ESM을 소개했다.
 * - ESM 이전에는자바스크립트 파일은 하나의 큰 파일로 작성되었기에 작은 단위의 모듈로 나눌 수 있는 기능이 요원했다.
 * - 왜냐하면 모듈 시스템 없다면 코드 관리가 어렵고 코드 재상용성이 매우 떨어지기 때문이다.
 * - ESM이 표준으로 소개 되기 전에 자바스크립트 생태계에는 CommonJS와 AMD라는 모듈 시스템이 있었다. 하지만 표준이 아니었기에 
 * - 모듈간의 호환성이 문제가 되었다.
 * - 그렇기에 ECAM에서 ESM이라는 표준 모듈 시스템을 소개한 것이다.
 * - 이로써 개발자는 프로젝트 코드를 표준 모듈 시스템인 ESM을 사용해 통일성 있게 모듈 단위로 작게 나누고 
 * - 모듈만의 독자적인 스코프를 갖게 할 수 있었다.
 * - 따라서 ESM 이후 코드 관리가 쉬워지고 코드 재사용성이 높아져서 자바스크립트의 생태계가 크게 성장할 수 있었다.
 * - 이번 섹션에서는 자바스크립트의 표준 모듈 시스템인 ESM에 대해서 알아보자.
 */